## 판다스 데이터 입출력

In [1]:
import pandas as pd

## CSV 파일 입력

In [2]:
# magic 명령어
# https://binaryworld.tistory.com/20
%%writefile sample1.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

UsageError: Line magic function `%%writefile` not found.

In [3]:
pd.read_csv("sample1.csv")

   1   1.11     one
0  2   2.22     two
1  3   3.33   three

In [4]:
pd.read_csv("sample2.csv")

   1   1.11     one
0  2   2.22     two
1  3   3.33   three

In [5]:
pd.read_csv("sample1.csv",header=None)

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [7]:
pd.read_csv("sample2.csv", names=["c1","c2","c3"])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [10]:
pd.read_csv("sample2.csv", index_col="c1")

ValueError: Index c1 invalid

In [11]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [12]:
pd.read_csv("sample4.txt",skiprows=[0,1])

         데이터 포맷의 설명:
c1  c2            c3
1   1.11         one
2   2.22         two
3   3.33       three

In [15]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
, 3.33, three

Writing sample5.csv

In [18]:
pd.read_csv("sample5.csv", na_values = ["누락", " "])

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [20]:
df = pd.read_csv("sample5.csv", na_values = ["누락", " "])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

## csv 파일 출력

In [21]:
df.to_csv("sample6.csv")

In [22]:
!cat sample6.csv

'cat'��(��) ���� �Ǵ� �ܺ� ����, ������ �� �ִ� ���α׷�, �Ǵ�
��ġ ������ �ƴմϴ�.

In [23]:
pd.read_csv("sample6.csv")

   Unnamed: 0   c1    c2      c3
0           0  1.0  1.11     one
1           1  2.0   NaN     two
2           2  NaN  3.33   three

In [25]:
df.to_csv("sample7.csv", sep="|", index = False)

In [26]:
!cat "sample7.csv"

'cat'��(��) ���� �Ǵ� �ܺ� ����, ������ �� �ִ� ���α׷�, �Ǵ�
��ġ ������ �ƴմϴ�.

In [27]:
pd.read_csv("sample7.csv",sep="|")

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

## 인터넷 상의 CSV 파일 읽기

In [28]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [33]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
pd.set_option("display.max_rows",10)  # 앞뒤로 모두 20행만 보여준다.
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q